# === CLI tools ===
brew "bat"
brew "bitwarden-cli"
brew "direnv"
brew "eza"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "git-filter-repo"
brew "jq"
brew "lazygit"
brew "lefthook"
brew "peco"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "yq"
brew "zoxide"

# === Runtime and package managers ===
brew "mise"
brew "pnpm"
brew "uv"

# === Database tools ===
brew "cloud-sql-proxy"
brew "golang-migrate"
brew "libpq"
brew "mariadb-connector-c"
brew "mkcert"
brew "mysql-client"
brew "pkgconf"
brew "postgresql@17"

# === CLI casks ===
cask "codex"

# === GUI apps ===
cask "bitwarden"
cask "bruno"
cask "chatgpt"
cask "codex-app"
cask "docker-desktop"
cask "elecom-mouse-util"
cask "gcloud-cli"
cask "ghostty"
cask "kap"
cask "karabiner-elements"
cask "maccy"
cask "obsidian"
cask "pgadmin4"
cask "raycast"
cask "rectangle"
cask "tableplus"

# === Cursor / VS Code extensions ===
vscode "anysphere.cursorpyright"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "openai.chatgpt"
vscode "renesaarsoo.sql-formatter-vsc"

# === Go tools ===
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "go.uber.org/mock/mockgen"
go "golang.org/x/tools/cmd/goimports"
go "mvdan.cc/gofumpt"

# === Rust tools ===
cargo "diff-viewer"
