# === CLI ツール ===
brew "bitwarden-cli"
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "git-filter-repo"
brew "golang-migrate"
brew "jq"
brew "lazygit"
brew "lefthook"
brew "mise"
brew "mkcert"
brew "mysql-client"
brew "peco"
brew "pkgconf"
brew "pnpm"
brew "postgresql@17"
brew "rclone"
brew "ripgrep"
brew "tmux"
brew "uv"
brew "volta"
brew "yq"
brew "zoxide"

# === DB コネクタ ===
brew "mariadb-connector-c"

# === GUI アプリ ===
cask "bitwarden"
cask "bruno"
cask "chatgpt"
cask "codex-app"
cask "docker-desktop"
cask "elecom-mouse-util"
cask "gcloud-cli"
cask "ghostty"
cask "karabiner-elements"
cask "kap"
cask "maccy"
cask "obsidian"
cask "pgadmin4"
cask "raycast"
cask "rectangle"
cask "tableplus"
