brew "bitwarden-cli"
brew "anyenv"
brew "eza"
brew "fswatch"
brew "fzf"
brew "gh"
brew "ghq"
brew "golang-migrate"
brew "mariadb-connector-c"
brew "mkcert"
brew "mysql-client"
brew "pkgconf"
brew "pnpm"
brew "postgresql@17"
brew "rclone"
brew "uv"
brew "volta"
cask "bitwarden"
cask "bruno"
cask "chatgpt"
cask "docker"
cask "elecom-mouse-util"
cask "gcloud-cli"
cask "ghostty"
cask "karabiner-elements"
cask "kap"
cask "obsidian"
cask "codex-app"
cask "raycast"
cask "rectangle"
